# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-03-23 16:18:17 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Cephalopod
  A podcatcher to make me happy.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2024-03-23 Sa 16:18]
   | Headline               | Time    |         |      |
   |------------------------+---------+---------+------|
   | *Total time*           | *11:35* |         |      |
   |------------------------+---------+---------+------|
   | *Cephalopod*           | *11:35* |         |      |
   | \_  /Components [0/0]/ |         | /11:35/ |      |
   | \_    Database [0/0]   |         |         | 7:07 |
   | \_    Catcher [0/0]    |         |         | 4:28 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Database [0/0]                                                 :database:
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-03-20 Mi 19:57]--[2024-03-20 Mi 22:50] =>  2:53
    CLOCK: [2024-03-20 Mi 18:33]--[2024-03-20 Mi 18:46] =>  0:13
    CLOCK: [2024-03-17 So 20:18]--[2024-03-17 So 21:29] =>  1:11
    CLOCK: [2024-03-16 Sa 16:48]--[2024-03-16 Sa 17:45] =>  0:57
    CLOCK: [2024-03-15 Fr 18:34]--[2024-03-15 Fr 19:27] =>  0:53
    CLOCK: [2024-03-15 Fr 17:17]--[2024-03-15 Fr 18:17] =>  1:00
    :END:
*** Catcher [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-03-23 Sa 15:44]--[2024-03-23 Sa 16:18] =>  0:34
    CLOCK: [2024-03-22 Fr 22:00]--[2024-03-22 Fr 23:03] =>  1:03
    CLOCK: [2024-03-22 Fr 19:30]--[2024-03-22 Fr 21:11] =>  1:41
    CLOCK: [2024-03-22 Fr 16:03]--[2024-03-22 Fr 16:14] =>  0:11
    CLOCK: [2024-03-16 Sa 18:35]--[2024-03-16 Sa 19:34] =>  0:59
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
